[
{"title": "Bitcoin energy pivot achieves what 'few industries can claim' — Bloomberg analyst", "subtitle": "Bitcoin's hash rate has continued to increase, yet its emissions intensity has been trending down, contrary to most other industries, Bloomberg analyst Jamie Coutts explained.", "author": "Martin Young", "timestamp": "2023-09-21", "content": "While the Bitcoin network has continued to expand over the years, the Bitcoin ( BTC ) mining industry has yet to see a comparable increase in carbon footprint — an achievement that a Bloomberg analyst argues “few industries can claim.” This, in turn, could drive the next wave of institutional investment. On Sept. 20, Bloomberg crypto market analyst Jamie Coutts cited data showing that the sustainable energy mix for Bitcoin has continued to rise since 2021 and is now over 50%. This has led to the growth of emissions slowing relative to the network's continued expansion. “Bitcoin as a global monetary network is scaling while its carbon impact declines. Few industries can claim this achievement.” He said that the evolving relationship between Bitcoin network growth and the global push to transition from fossil fuels could “catalyze a wave of institutional and even sovereign investment capital.” The analyst added that as energy constitutes well over 50% of mining's operational costs: “The incentive to acquire the cheapest energy sources is contributing to the network's rising hash rate while simultaneously reducing the industry's emissions or carbon intensity.” Bottom Line: If the network scales to hundreds of millions of users, the impact on global carbon emissions will be minimal, and the technology itself is likely to play a pivotal role in the transition away from fossil fuels — Jamie Coutts CMT (@Jamie1Coutts) Energy emissions refer to the greenhouse gases and air pollutants emitted as byproducts from different energy sources and activities, whereas carbon intensity measures how clean the electricity is. On Sept. 18, Cointelegraph reported that the next generation of Bitcoin miners was focusing on alternative energy sources for efficiency . However, the percentage of sustainable energy used in Bitcoin mining has been a point of debate, as Cambridge University's model (which hasn't been updated since January 2022) stated that mining from sustainable energy sources is just 37.6%. Climate technology venture investor and activist Daniel Batten, however, argues that this is actually above 50%. Google is learning pic.twitter.com/xt8flWKN63 — Daniel Batten (@DSBatten) He said in an X post that the Cambridge figures were out because off-grid mining and methane mitigation are currently not included in its calculations. Earlier this year, Batten reported that the intensity of Bitcoin mining emissions had fallen to its lowest-ever level. Moreover, he predicts that the Bitcoin network will become carbon neutral by December 2024. “By 2030, the Bitcoin network is projected to mitigate 10x more emissions from the atmosphere than it produces, an astonishing achievement,” claimed Batten. Bitcoin is on a collision course with 'Net Zero' promises", "url": "https://www.cointelegraph.com/news/bitcoin-renewable-mix-emissions-good-for-investors-bloomberg-analyst"},
{"title": "Breaking: Mt. Gox trustee changes repayment deadline to October 2024", "subtitle": "Rehabilitation trustee Nobuaki Kobayashi has extended the Mt. Gox repayment deadline by one year.", "author": "Tom Mitchelhill", "timestamp": "2023-09-21", "content": "Mt. Gox trustee Nobuaki Kobayashi has officially changed the deadline for paying back the exchange's creditors from Oct. 31, 2023, to Oct. 31, 2024. In a Sept. 21 letter , Kobayashi wrote that, with the permission of the Tokyo District Court, he had extended the deadline for the base repayment, the early lump-sum repayment and the intermediate repayment. Additionally, Kobayashi explained that, for rehabilitation creditors who have provided the necessary information, repayments will be made in sequence as early as the end of this year. “Please note that the schedule is subject to change depending on the circumstances, and the specific timing of repayments to each rehabilitation creditor has not yet been determined,” Kobayashi added. Presently, the Mt. Gox estate holds some 142,000 Bitcoin ( BTC ), 143,000 Bitcoin Cash ( BCH ) and 69 billion Japanese yen. Mt. Gox was one of the earliest cryptocurrency exchanges, once facilitating more than 70% of all trades made within the blockchain ecosystem. Following a major hack in 2011, the site subsequently collapsed in 2014 due to alleged insolvency; the fallout affected about 24,000 creditors and resulted in the loss of 850,000 BTC. This is a developing story, and further information will be added as it becomes available.", "url": "https://www.cointelegraph.com/news/mt-gox-trustee-changes-repayment-deadline-october-2024"},
{"title": "Bitcoin pioneer Hal Finney talks ZK-proofs in 25-year-old unearthed footage", "subtitle": "A recently resurfaced video shows Hal Finney discussing the possibility of zero-knowledge proofs at an annual cryptology conference in California some 25 years ago.", "author": "Tom Mitchelhill", "timestamp": "2023-09-21", "content": "Early Bitcoin ( BTC ) pioneer Hal Finney shared his vision for zero-knowledge (ZK) proofs more than 25 years ago, a full decade before the launch of the first cryptocurrency, Bitcoin. The video, purportedly from the Crypto '98 conference held on Aug. 26, 1998, in Santa Barbara, shows Finney discussing in detail the concept of zero-knowledge proofs, a cryptographic technology that gained immense popularity decades later. NEW: Bitcoin legend Hal Finney discusses Zero-Knowledge Proofs in a newly unearthed presentation, made 25 years ago at Crypto '98 in Santa Barbara. Have you ever heard @halfin 's voice before? pic.twitter.com/HdddworTsg — Trust Machines (@trustmachinesco) Finney explains how one could hypothetically perform a zero-knowledge proof on a SHA-1 hash, describing the possibility of sending a cryptographically encrypted claim without revealing any of the details contained within the same claim. “I want to prove to you that I know a message that hashes to a given hash value using the SHA-1 hash. I don't want to reveal anything about the message to you. It's a zero-knowledge proof, and I've written a program to do this that I'll tell you about,” explained Finney. A ZK-proof is a cryptographic protocol that enables one user (the prover) to convince another (the verifier) that a particular claim is true without disclosing any details about the claim itself. The concept of zero-knowledge proofs was first conceived in 1985. At the time of Finney's speech, zero-knowledge proofs were considered a possibility, but due to hardware limitations at the time, they were widely regarded as, as Finney puts it, “inefficient or impractical.” Decades later, the crypto industry is now abuzz with discussions and debates on how best to implement zero-knowledge proofs, with the main use of the technology being leveraged to scale the Ethereum network . Finney is a storied pioneer of the cryptocurrency industry. He was a computer scientist who made some of the earliest contributions to privacy-enhancing technology, including the first fully anonymous remailer, a tool that protected user identity when sending emails. Additionally, Finney created the first reusable proof-of-work system, which preceded Bitcoin by nearly five years. In 2009, Finney was the very first recipient of Bitcoin after he was transferred 10 BTC by the cryptocurrency's pseudonymous founder, Satoshi Nakamoto, and was known to have worked closely alongside Nakamoto in Bitcoin's earliest days. Some have speculated that Finney himself could be Satoshi Nakamoto, though he has denied the theory. Finney was diagnosed with a rare neurological disease known as ALS, or Lou Gehrig's disease, the complications of which would later claim his life in 2014. Finney was cryopreserved by the Alcor Life Extension Foundation in Arizona. The video could be one of the first times that some people have been able to hear Finney's voice, suggested TrustMachines on X.", "url": "https://www.cointelegraph.com/news/bitcoin-pioneer-hal-finney-talks-zero-knowledge-proofs-newly-surfaced-video"},
{"title": "UK politicians don metaverse avatars as they share Web3 roadmap", "subtitle": "“Web3 represents a paradigm shift that reimagines the very fabric of the internet,” said British MP Natalie Elphicke.", "author": "Martin Young", "timestamp": "2023-09-21", "content": "A group of British politicians took to the metaverse to address global leaders in a 51-nation gathering on Sept. 20, setting out a vision for the United Kingdom's blockchain and Web3 industries. The metaverse gathering saw eight British Lords and politicians address global leaders on the opportunities and challenges posed by the growth of Web3 technology Natalie Elphicke, member of parliament and chair of the new All Party Parliamentary Group (APPG) for Blockchain Technologies, appeared as her unique avatar in the metaverse, where she stressed the importance of the next iteration of the internet: “Web3 represents a paradigm shift that reimagines the very fabric of the internet.” As chair of the APPG on blockchain technologies, I was pleased that me and Avatar Natalie could join the British Blockchain Association's Global Summit today to give a keynote speech - held in the metaverse. @Brit_blockchain @APPGBlock pic.twitter.com/hDriQA5rAv — Natalie Elphicke MP (@NatalieElphicke) In her keynote, Elphicke said that the U.K. has the potential to become a blockchain-enabled “smart country” but noted the nation was “lagging competitors” in securing blockchain-related jobs. The first U.K. national priority is Web3 industry growth and workforce planning, she said before adding: “Part of that is about making the U.K. an attractive hub for Web3 founders, developers, programmers and companies to work here.” Elphicke called for more national blockchain roadmaps and collaboration between countries, commenting that so far, fewer than 12 countries have published roadmaps. She said another priority was taking forward the National Blockchain Roadmap, published in 2021. The roadmap sets out an ambition to build a blockchain-based “digital nation,” with the technology being applied to climate mitigation efforts, industrial symbiosis networks and digital identity programs. She also mentioned DeFi, stating that it poses “unique challenges and opportunities for regulators and policymakers,” before adding that “ensuring transparency, auditability, and accountability in these ecosystems is paramount.” The Conservative Party politician also spoke about real-world asset tokenization. “It is unquestionable that our world is being tokenized,” she said before adding, “Physical assets are getting tokenized, and this trend will only grow from here.” However, on Sept. 19, the Online Safety Bill, aimed at regulating certain U.K. internet services, including activities in the metaverse, passed through parliament . Is the metaverse really turning out like 'Snow Crash?'", "url": "https://www.cointelegraph.com/news/uk-politicians-metaverse-speech-share-web3-roadmap"},
{"title": "Wormhole integrates native USDC transfers for four blockchain networks", "subtitle": "Wormhole integrated with Circle's Cross-Chain Transfer Protocol, allowing USDC to be sent between Ethereum, Avalanche, Arbitrum and Optimism.", "author": "Tom Blackstone", "timestamp": "2023-09-20", "content": "Wormhole has integrated Circle's Cross-Chain Transfer Protocol (CCTP), allowing USD Coin ( USDC ) to be transferred between Ethereum, Avalanche, Arbitrum and Optimism via Wormhole-based bridges, according to a Sept. 20 announcement. The new feature is available to end-users via the Portal bridge, and developers can integrate it into their own apps using Wormhole Connect. The Wormhole team claimed that the new integration will reduce liquidity issues and user confusion. “On these new and emerging chains, multiple versions of these bridged USDC tokens can exist,” it stated, “which can lead to fragmented liquidity, poor pricing, and a confusing experience for users and developers alike.” CCTP will help fix this problem by “creating a natively cross-chain USDC that can be burned and minted across connected chains,” it stated. When Circle first issued USDC, it was only available on Ethereum. If a user wanted to transfer USDC to another chain, they needed to use a bridge to lock up their native USDC on Ethereum and mint a derivative version on the other chain . However, multiple bridging protocols with various derivative versions of USDC could sometimes cause confusion among end-users. In 2021, Circle launched its stablecoin on a second chain , Stellar. It continued to launch on additional chains afterward, bringing the number of compatible networks to 14 as of Sept. 20. But for a user to transfer native USDC from one network to another, they still needed to deposit their coins to a Circle partner's account and then withdraw them to another network using that account. Partially because of this complexity, many users continued to use bridged versions of the coin instead of its native version. On April 26, Circle launched CCTP , which is a set of smart contracts and an application programming interface (API) that can be used to burn USDC on one chain and have it be re-minted on another chain without the user needing to deposit to a Circle partner account. At the time of its launch, CCTP only allowed transfers between Ethereum and Avalanche or vice-versa. Since then, it's been expanded to support Optimism and Arbitrum networks as well. Circle plans to add additional networks in 2023, according to the protocol's documents. The Sept. 20 announcement states that CCTP has now been integrated into the Wormhole bridge interface, allowing Wormhole users to transfer native USDC between CCTP-supported chains for the first time. These networks currently include Ethereum, Optimism, Avalanche and Arbitrum. Wormhole is not the only bridge that has implemented or intends to integrate with CCTP. Wanchan provides a similar feature, and according to Circle's April 26 announcement, Celer, Hyperlane, LayerZero and LI.FI have also stated that they intend to implement it soon.", "url": "https://www.cointelegraph.com/news/wormhole-integrates-native-usdc-transfers-blockchain-networks"},
{"title": "Phishing victim sends eye-watering $4.5M in USDT to scammer", "subtitle": "On-chain data shows the $4.5 million was first transferred from the Kraken crypto exchange before eventually arriving at an address purportedly owned by a scammer.", "author": "Brayden Lindrea", "timestamp": "2023-09-21", "content": "An unwitting cryptocurrency holder has reportedly fallen victim to an eye-watering $4.46-million phishing scam . According to data from Etherscan , $4.46 million in Tether ( USDT ) was withdrawn from a Kraken crypto exchange wallet and eventually sent to an address ending in “ACa7.” Blockchain security firm PeckShield has labeled the address as being owned by a phishing scammer. #PeckShieldAlert The address 0x2175...f7D9 got scammed for 4.46M $USDT Victim's address: 0x2175c0082d052872501f7fe54e1aC59858aaf7D9 Scammer's address: 0xAbb07822F471773Ff00b9444308ceEB7cf0dACa7 pic.twitter.com/Ny9CIrkBxw — PeckShieldAlert (@PeckShieldAlert) Another blockchain scam platform, Scam Sniffer, suggested on Sept. 20 that the funds were sent to an address linked to a “fake Coinone crypto mining exchange.” someone withdrew $4.46 million from Kraken to a fake Coinone crypto-mining exchange about 1 hour ago. https://t.co/ued55jlWdM pic.twitter.com/tsV5BGDY0O — Scam Sniffer (@realScamSniffer) Scam Sniffer linked to a user-created Dune Analytics dashboard, suggesting attacks of this nature have seen scammers steal approximately $337.1 million in USDT in total, impacting as many as 21,953 individuals. The Global Anti-Scam Organisation says this type of approval mining scam usually tricks victims into authorizing unlimited withdrawals from their cryptocurrency wallet. “When you create a self-custody crypto wallet [...] you obtain a 'private key' that is safeguarded through encryption. However, the fraudsters do not need your seed phrase,” GASO said, explaining on its website that when a victim clicks to partake in the fake mining pool, they're clicking on a button that will request a $10-$50 network fee in Ether ( ETH ). While it seems reasonable, GASO suggests it is to trick the user: “This is merely a front to obtain your digitally signed authorization, allowing unlimited access to your wallet via the USDT smart contract.”", "url": "https://www.cointelegraph.com/news/phishing-victim-sends-eye-watering-4-5m-in-usdt-to-scammer"},
{"title": "Optimism to sell $160M in OP tokens to 7 purchasers via private sale", "subtitle": "The Optimism network has revealed that it will sell 116 million OP tokens in a series of planned sales.", "author": "Tom Mitchelhill", "timestamp": "2023-09-21", "content": "Ethereum layer-2 scaling solution Optimism has disclosed plans to sell 116 million OP tokens to seven private buyers for treasury management purposes. At current prices, the sale will see $159 million worth of OP tokens change hands. Starting today, there will be several transactions totaling approximately 116M OP tokens. We're sharing as a heads up to our community that these are planned transactions. — Optimism (✨_✨) (@optimismFND) While some observers feared the sale would bring about depressed prices from Optimism “dumping” its tokens on the market, it seems unlikely that the sale of the tokens will have any material impact on the price of OP due to the sale being private. Additionally, the tokens are being sourced from the unallocated portion of the OP token treasury, meaning that they are not part of the circulating supply. As explained on the Optimism website, the tokens are subject to a two-year lockup period, meaning that buyers are unable to sell them on secondary markets. Buyers have, however, been granted permission to delegate the tokens to unaffiliated third parties for governance purposes. According to Optimism, this sale is part of its original plan and is completely accounted for in its “original working budget of 30% of the initial token supply.” The sale comes just two days after Optimism announced its third airdrop, where 19.4 million OP tokens were allocated to more than 31,000 addresses that took part in delegation activities relating to the network's decentralized autonomous organization (DAO), Optimism Collective. Today Optimism is announcing OP Airdrop #3. 19M OP allocated to over 31k unique addresses to reward positive-sum governance participation in the Collective. Read on for details on eligibility criteria and allocations. — Optimism (✨_✨) (@optimismFND) Optimism, Polygon and Arbitrum stand as the most heavily used layer-2 scaling solutions in the industry. Despite trailing behind Arbitrum in terms of total value locked, Optimism saw its total transactions eclipse that of Arbitrum in August, driven largely by a surge in activity from Coinbase's sandbox and the identity verification project Worldcoin.", "url": "https://www.cointelegraph.com/news/optimism-private-token-sale-op-token-price"},
{"title": "U.S. Anti-CBDC bill moves a step closer to passing", "subtitle": "The “CBDC Anti-Surveillance State Act,” aimed at preventing the Federal Reserve from issuing a central bank digital currency, has passed the House Financial Services Committee.", "author": "David Attlee", "timestamp": "2023-09-21", "content": "The “CBDC Anti-Surveillance State Act,” aimed at preventing “unelected bureaucrats in Washington” from issuing a central bank digital currency (CBDC), has taken one step further on its procedural journey after it passed the House Financial Services Committee. According to a press release distributed by the bill's author, Representative Tom Emmer on Sept. 20, the “CBDC Anti-Surveillance State Act” was passed out of the committee and favorably reported to the House floor. That means the bill will next face a congressional vote. Emmer stressed that the bill has already gained the support of 60 members of congress. In his remarks regarding the Committee's decision, Emmer once again emphasized the dangers of state control over currency, and its incompatibility with American values: “American values. American values. This is what the future global digital economy needs. If not open, permissionless, and private - just like cash - a central bank digital currency is nothing more than a CCP-style surveillance tool that can be weaponized to oppress the American way of life.” Emmer and 49 original co-sponsors reintroduced the “CBDC Anti-Surveillance State Act” in the United States House of Representatives on Sept.14 . It was first formally introduced to Congress in February 2023. The bill contains provisions that would prevent the Federal Reserve from issuing a CBDC to individuals and bars the Fed from utilizing any CBDC for the purpose of implementing monetary policy. In his recent interview with Cointelegraph , Rep.Emmer called digital assets a “sleeper issue” in U.S. politics, both at the state and federal levels. According to Emmer, there is a generational divide in the U.S. in which residents could push back on policies that potentially inhibit the digital space and, in doing so, “flush out” technologically ignorant lawmakers.", "url": "https://www.cointelegraph.com/news/us-anti-cbdc-bill-moves-closer-to-passing"},
{"title": "'AI has killed the industry': EasyTranslate boss on adapting to change", "subtitle": "Easy Translate boss Frederik R. Pedersen saw the writing on the wall back in 2020 and is now trying to get the most out of AI and his human staff.", "author": "Monty Munford", "timestamp": "September 20, 2023", "content": "The launch of generative AI products over the past nine months has the world talking about how it will change the future. Many are frightened. Others are excited about the opportunity. A report last month from Next Move Strategy Consulting the AI industry will grow 20x in the next seven years, creating a $2 trillion business, up from its current value of $100 billion. It might sound like wild hype, but other analysts from McKinsey, Morgan Stanley and BlackRock all map out a similar trajectory. AI is here to stay, and a lot of human lives will be upended. But it's also the chance of a lifetime. Frederik Pedersen, the co-founder of Danish AI company and son of one of Denmark's most famous men, is approaching the future head-on. “I have been saying for a long time that translation is dead and AI has killed the industry as we know it, but that hasn't gone down particularly well with my competitors. Now, however, those same people are listening and are realising that they may be too late if they want to transform their business.” It's not easy to be the child of a powerful person, as has been recently and brilliantly illustrated by the TV series If there's a Logan Roy in the family, it's difficult for the child to be their own person. Some crash and burn; some, such as singers Justin Bieber and Miley Cyrus, try to shock their parents by being outlandish and independent. It's rarely a good look. Others, however, do it in smarter ways and emerge from that parental shadow by adopting different mechanisms to build their own reputation. In the case of Pederson, now 35, it was technology that enabled him to do so. First, with translation software, and now, generative AI has overtaken it. His dad, Klaus Riskær Pedersen, is a controversial Danish political party leader, entrepreneur, businessman and author. Everybody in Denmark knows his name. His chequered career includes being a member of the European Parliament for the Liberal Party, writing books, developing, building and selling around 15 companies over three decades. He set up his own political party in 2018. But there have been controversies. He has several convictions for fraud and has spent different spells in jail, as well as splitting Danish public opinion and having the social life that goes with such apparent conviviality. At first, (Frederik) Pedersen suffered. In and out of schools, he tried to find a way of acceptance and struggled. He didn't make it to university, but he did know about technology and became interested in its power and consequently found a way to plow his own furrow. “It took me some time to find a direction, but slowly I realized that the world was all about communication. I knew I was from a privileged family, but educators always seemed to have a lack of empathy and communication when I was a child. I was made to feel different, and it was a difficult place to be. “But I came through it, and those life lessons set me up for all the changes that life throws at you. So I set up a translation company, and now I'm pivoting the company into because of the huge opportunity it offers humanity, not least the same elements of communication,” says Pedersen. The AI light started to dawn on him back in 2020. That year, Pedersen applied to the Danish Innovation Fund for a 65,000 euro grant to create a content generator engine that would enable him to create a new form of translation: “I realized that the biggest issue in e-commerce when it came to languages was not translation in itself, but creating localized content for retailers' different products that customers could relate to,” he explains, adding the company spent the money to train “neural networks to create these product descriptions.” A neural network is a type of machine learning process called deep learning that uses interconnected nodes or neurons in a layered structure that resembles the human brain. “We branded it content-as-a-service and couldn't believe we were one of the first companies to do it,” he says, though it ended up proving the old adage that being early is the same as being wrong. “Ultimately we were ahead of the technology and while our technology could build sentences, it just wasn't good enough for our customers.” This first effort was not wasted time and money, however, as it meant the company was able to hit the ground running when large language models were released publicly. EasyTranslate obtained early access to ChatGPT because it already had an account with OpenAI and was able to adopt and execute the technology instantly. From that point, EasyTranslate pivoted to a generative AI content future based on Pedersen's thesis that traditional translation was indeed “dead.” Are we \"sunsetting\" translation? And will human copywriters go extinct? Read our take on the role of humans in this new era and check out this thought-provoking article about and 👇🏽 It was not the first change in direction for Pedersen's company. Formed in 2010 without venture capital, the translation service grew quickly. In 2016, it went after bigger fish and started offering interpretation services to the Danish government after realizing there was an opportunity with the launch of Apple's FaceTime. According to Pedersen, interpreters were super-expensive, inefficient and slow, and travel for in-person events wasn't exactly “climate change-friendly.” Pedersen created a video interpretation app that streamlined costs and increased efficiency by offering a marketplace and matching service for interpreters as well as remote interpreter services. Danish municipalities signed up for the service, including the Danish Ministry of Justice, recognizing that bringing an interpreter to a court was a very expensive business, especially due to the often last-minute nature of such needs. Are You Independent Yet? Financial Self-Sovereignty and the Decentralized Exchange Meet Dmitry: Co-founder of Ethereum's creator Vitalik Buterin At its height, the company was running 1,000 interpretation meetings a day, and between 2017 and 2019, it was responsible for more than 70% of the Danish government's interpretation business. However, Pedersen says the Danish government had never outsourced such business, and the relationship turned sour. “It was a very mutual and fruitful relationship for a long time, but we realized that working with governments was more difficult than we imagined. It was like the cliche of a heavy tanker not being able to turn around. “Again, it was the first learning curve for me. Yes, our data processing wasn't as good as it could have been and working with antiquated systems and reasoning was very difficult. “Eventually, the Danish government decided they didn't want to carry on with our relationship. It was hard at the time, but I still believe we succeeded, and we learned a lot,” he says. “Let's just say, the operation was a success, but the patient died. There was also a lot of opposition from the strong Danish trade unions who thought we were putting people out of jobs.” “But it was not about putting people out of jobs, it was working with technology in the same way we work with AI now. Our interpreters who decided to join our community were extremely happy with our software. They said it was like having a PA that coordinated their calendar and ensured them productive days with the highest possible earnings — they managed to increase those earnings.” If your book is in the ChatGPT training data, did they steal it? If you make something with Midjourney, do you own it? Old questions and new arguments. The impact of AI technology on employment is a source of great anxiety for many, with some predicting entire industries will be wiped out, while others suggest jobs will change and evolve rather than disappear. A recent by the International Labour Organization found that women will be disproportionately affected by automation, with around 7.8% of jobs held by women in high-income countries (or 21 million) likely to be automated, but only 2.9% of jobs held by men (9 million). Translation is a highly gendered industry too, with women accounting for around 67% of translators. Pedersen's thinking about the essential human element in technology — be that content generation or generative AI — is now central to EasyTranslate's business. He believes that the combination of humans and AI is more powerful than just letting the AI do everything, using the example of a hard-working high school student who was angry at classmates for using AI to cheat. Instead of cheating herself, she asked ChapGPT to mark her already-written essay. It sorted out the grammar and typos, and it gave her extra resources and links to improve her work beyond that of the cheater. “In business, everybody is looking for the magic of balance in the marketplace, that sweet spot where pricing, innovation and technology are aligned. We are also doing that when it comes to AI and humans; we want that magic balance there as well,” he says. Blockchain and crypto empowers regular people to collectively own AI and will \"keep humans in the loop\". (Via ) He cites “humans in the loop” as the way forward for humans and machines. Generative AI can do the heavy lifting, and can finish and finesse the job. It creates content in any language generated by AI but enhanced by humans. “There are others in business, such as who also profess the 'humans in the loop' phrase. Again, I've been saying for a long time that this is the way forward to make both technology and humans better. “By harnessing the power of both and increasing machine learning in the process, I believe that the current dominance of LLMs will be replaced by small language models that can be tailored exactly for the customer — open source generative AI — that will be the future.” “That's what we're planning for and how the whole AI sector will play out. Those companies that are prepared for that will prosper; those who aren't will fail,” he says. Since Pedersen's pivot to AI at the end of 2022, there has been increased investor interest in EasyTranslate, and the company 2.75 million euros earlier this year “We think that we've been ahead of our time, and that thinking has led us to embrace AI and take us to the next level. AI itself is just the mirror of what humanity has already created; AI is really the technological history of human knowledge. “I think it's obvious that the two are perfectly compatible, that magic balance, so as generative AI evolves, so will those humans in the loop. Nobody with a good and adaptive brain will lose their job; their jobs and roles will be better and more creative,” he concludes. His father should be proud. \n\t \n When worlds collide: Joining Web3 and crypto from Web2 Coinbase screws up, Florida bans CBDCs, and Ordinals face controversy: Hodler's Digest, May 7-13 NFT collapse and monster egos feature in new Murakami exhibition Wolf Of All Streets worries about a world where Bitcoin hits $1M: Hall of Flame How smart people invest in dumb memecoins: 3-point plan for success Big Questions: Did the NSA create Bitcoin? Tokenizing music royalties as NFTs could help the next Taylor Swift", "url": "https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/"},
{"title": "Grayscale files for new Ether futures ETF — Official", "subtitle": "Grayscale Advisors is in the process of becoming registered as a commodity pool operator with the U.S. CFTC for Grayscale's new Ether futures ETF.", "author": "Helen Partz", "timestamp": "2023-09-20", "content": "Digital currency investment company Grayscale is the latest firm to file with the Securities and Exchange Commission for a new Ether ( ETH ) futures exchange-traded fund (ETF) On Sept. 19, Grayscale proposed listing and trading shares of the Grayscale Ethereum Futures Trust ETF under the New York Stock Exchange Arca Rule 8.200-E. The proposal is pursuant to the provisions of the Securities Exchange Act of 1934 and rule change submitted by NYSE to the SEC. The ETF is managed by Grayscale Advisors, also referred to as the “sponsor” in the filing. “The Sponsor is in the process of becoming registered as a commodity pool operator with the Commodity Futures Trading Commission and is in the process of becoming a member of the National Futures Association,” the document reads. It also states that Grayscale Advisors has engaged Videnct Advisory as a subadviser to serve as the trust's commodity trading adviser. The Grayscale Ethereum Futures Trust seeks to maintain its holdings in Ether futures contracts with a “roughly constant expiration profile,” the filing reads, adding that it will “never carry futures positions all the way to cash settlement.” The nature of the Ether futures contracts in the ETF will not require the trust to use an Ether custodian, the filing reads, adding: “The trust will deposit an initial margin amount to initiate an open position in futures contracts. A margin deposit is like a cash performance bond. It helps assure the trader's performance of the futures contracts that he or she purchases or sells.” The news comes a few weeks after the digital asset management firm Valkyrie also filed for an Ether futures ETF with the SEC in mid-August, following several other firms filing for ETH futures ETFs. On Aug. 17, Bloomberg reported that the SEC was set to allow the first ETFs based on Ether futures, spurring much optimism regarding the Ethereum market. Last month, Grayscale scored a major, though partial, victory against the SEC in its efforts to convert its over-the-counter Grayscale Bitcoin Trust (GBTC) into a listed spot Bitcoin ETF. The SEC had rejected its GBTC application, after which Grayscale sued. The appeals court ordered that Grayscale's petition for review be granted and the SEC's order to deny the GBTC listing application be vacated. This victory, despite not guaranteeing the eventual listing of a Grayscale spot Bitcoin ETF, was still greeted with enthusiasm by the community.", "url": "https://www.cointelegraph.com/news/grayscale-files-for-new-ethereum-futures-etf"},
{"title": "Bitcoin price eyes $28K as Binance legal battle spurs bullish momentum", "subtitle": "Discover how margin and option metrics hint at Bitcoin's path to $28,000 amid the Binance legal battle.", "author": "Marcel Pechman", "timestamp": "2023-09-20", "content": "The ongoing legal battle between the Binance cryptocurrency exchange and the United States Securities and Exchange Commission (SEC) took a surprising turn on Sept. 18. Magistrate Judge Zia Faruqui rejected the SEC's request for access to Binance.US's systems. Instead, the judge suggested that the SEC should formulate specific discovery requests. While this decision only temporarily postponed the need for Binance to demonstrate the separation between Binance.US's custody solution and Binance International, the market responded positively. Bitcoin ( BTC ) surged to its highest level in three weeks , breaking above the $27,000 resistance. Traders are now wondering whether the rally has been supported by leverage or genuine spot buying demand. This is where metrics related to Bitcoin derivatives could potentially provide the solution. Judge Faruqui scheduled a follow-up hearing for Oct. 12 and called upon the involved parties to submit a status report before the event, as reported by Yahoo Finance. What might have seemed like a setback for the SEC, at least for the time being, could potentially increase the risks for Binance. Binance founder and CEO Changpeng “CZ” Zhao remains steadfast in asserting that Binance.US has never utilized Binance's global custody solutions, despite a document from Binance.US on Sep. 15 suggesting otherwise . Nevertheless, the SEC has yet to produce clear evidence of Binance attempting to mislead the court. Regardless of the current evidence, or more accurately, the absence of reliable information provided by Binance, the outlook for Bitcoin bulls has significantly improved for the next three weeks, with no anticipated changes until the upcoming court hearing. To gauge the increasing optimism among professional traders, let's examine Bitcoin's margin and derivatives metrics. Margin markets offer valuable insights into the positioning of professional traders as they enable investors to increase their exposure through stablecoin borrowing. Conversely, Bitcoin borrowers can speculate on a cryptocurrency's price decline. A declining indicator suggests that traders are becoming less bullish, while a ratio exceeding 30 typically indicates excessive confidence. Recent data reveals that the margin-lending ratio for OKX traders has dropped to its lowest point in three months, standing at 19x, down from 27x just a week ago. These findings suggest that the overwhelming dominance of leverage long positions has diminished, although the current ratio still favors the bulls. Market sentiment can also be assessed by analyzing whether more activity is occurring through call (buy) options or put (sell) options. A put-to-call ratio of 0.70 indicates that put option open interest lags behind the more bullish calls, implying a bullish momentum. Conversely, a 1.40 indicator favors put options, signifying bearish sentiment. The put-to-call ratio for Bitcoin options volume has recently shifted from favoring put options at 1.50 to a balanced 1.04 level on Sept. 20, indicating a reduced interest in protective puts. Notably, since Sept. 18, BTC options volume has either been neutral or slightly favored put options, suggesting that professional traders were caught off-guard by the price rally above $27,000. Binance CEO refutes report on $250M loan to BAM Management Both Bitcoin margin and options markets indicate a balanced demand between long and short positions. From a bullish perspective, this suggests that excessive leverage hasn't been utilized as Bitcoin's price climbed from $26,500 to $27,500 on Sept. 19. However, bears may find solace in the fact that even as Bitcoin's price reached its highest level in three weeks, there was limited enthusiasm from buyers in the margin and options markets. Nonetheless, the data does hint at buying support from spot orders, possibly indicating that big entities, or so-called whales , are accumulating regardless of price. Now, BTC and other crypto bulls have a window of three more weeks until Oct. 12, when the Federal Judge will convene another hearing and potentially issue orders that could pose challenges for Binance.US. In the meantime, a Bitcoin price rally above $28,000 is certainly on the table. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author's alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.", "url": "https://www.cointelegraph.com/news/bitcoin-price-binance-sec-legal-battle-bullish"},
{"title": "The Author's Guild launches class-action lawsuit against OpenAI", "subtitle": "The Author's Guild opened a lawsuit against OpenAI, alleging misuse of copyrighted material in training of its AI models.", "author": "Savannah Fortis", "timestamp": "2023-09-20", "content": "The Author's Guild in the United States opened a class-action lawsuit against the Microsoft-backed OpenAI on Sept. 19 due to its alleged misuse of copyrighted material in the training of its artificial intelligence (AI) models. According to court documents, the oldest and largest professional organization for writers in the U.S. is operating under the Copyright Act and seeking “redress” for what it calls “flagrant and harmful infringement” of registered copyrights in written works of fiction. It goes on to argue that works were copied wholesale and without permission or “consideration” by feeding them into large language models (LLMs). “These algorithms are at the heart of Defendants' massive commercial enterprise. And at the heart of these algorithms is systematic theft on a mass scale.” The Author's Guild said it represents a class of professional fiction writers whose “works spring from their own minds and their creative literary expression.” It says, therefore, that since their livelihoods derive from these creative works, the LLMs “endanger” the ability of fiction writers to make a living. It suggested that the AI models could've been trained via the public domain, or OpenAI could have paid a licensing fee for the usage of the copyrighted works. “What Defendants could not do was evade the Copyright Act altogether to power their lucrative commercial endeavor, taking whatever datasets of relatively recent books they could get their hands on without authorization.” On Sept. 11, the Guild posted an article on X about how authors can protect their work from AI web crawlers. Did you know that you can block OpenAI's web crawler from accessing their website? We've gathered some practical tips for authors to utilize so that they may protect their work from AI. https://t.co/6PwAre6hFt — The Authors Guild (@AuthorsGuild) Pinned to the top of its profile, the Author's Guild has a link to its advocacy work in regards to AI technologies. This filing from the Author's Guild follows updates in a similar lawsuit against Meta and OpenAI and their respective AI models using copyrighted material in training. Author Sarah Silverman and others opened the lawsuit in July; however, now both companies have asked judges to dismiss the claims . In August, the U.S. Copyright Office issued a notice of inquiry on AI, seeking public comment on topics related to AI content production and how it should be handled by policymakers when AI content mimics that which is made by human creators. Prior to the inquiry, U.S. District Judge Beryl Howell ruled that artwork created solely by AI is not eligible for copyright protection.", "url": "https://www.cointelegraph.com/news/authors-guild-class-action-lawsuit-open-ai"},
{"title": "Discord crypto trading bot shuts down after 'critical exploit'", "subtitle": "The bot was valued at $16.5 million during its token debut last month.", "author": "Zhiyuan Sun", "timestamp": "2023-09-20", "content": "None Trading, a trading tool for cryptocurrencies and nonfungible tokens (NFT) built on Discord, has shut down due to a “critical exploit” within its infrastructure. In a Sept. 20 announcement, None Trading said it had “lost a significant amount of funding” as well as “team tokens” crucial for its operations. “Alongside this, we have lost 3 core team members that are required to keep the project running healthily. This unfortunate incident has put us in a financial and infrastructural position that makes it simply impossible to continue running the company effectively.” “As a result, we are left with no other option but to cease operations as a company.” At the time of publication, the project's Discord, Telegram and official websites have been taken down. None Trading wrote that tokenholders will have a 30-day window to claim their rewards before going offline. The project's NONE token plunged nearly 80% on the news to $0.074 apiece. At the time of launch last month, NONE had a self-reported market cap of $16.5 million. The project was launched in May. Prior to its shutdown, None Trading held itself as the “all-in-one trading solution directly in discord.” Users could either access the bot for free or pay a 300 NONE fee for premium trading. The None Trading bot then collected a 0.3%-0.6% commission based on each trade. Its anonymous CEO, Carve, claimed to be a 19-year-old active in the NFT and token space since 2021, having developed several projects. Dear None Trading Community, It is with a heavy heart that we must deliver some unfortunate news today. We want to begin by expressing our deep sorrow and regret for the recent events that have transpired, which have forced us to make an incredibly difficult decision. None… — NONE (@nonethio) 'AI has killed the industry': EasyTranslate boss on adapting to change", "url": "https://www.cointelegraph.com/news/discord-crypto-trading-bot-shuts-down-critical-exploit"},
{"title": "Price analysis 9/20: BTC, ETH, BNB, XRP, ADA, DOGE, SOL, TON, DOT, MATIC", "subtitle": "Bitcoin and other cryptocurrencies are likely to witness a pick up in volatility following the Fed's rate decision on Sep. 20.", "author": "Rakesh Upadhyay", "timestamp": "2023-09-20", "content": "Bitcoin's ( BTC ) recovery is facing selling above $27,000, indicating near-term nervousness due to the Federal Reserve's meeting on Sep. 20. However, long-term investors are unfazed and they have continued to accumulate. Glassnode data shows that Bitcoin's inactive supply has been at all-time highs since July. This bullish temperament is not reflected in institutional activity, however. Investors have cut down on their cryptocurrency exposure and are sitting on the sidelines awaiting more clarity on the regulatory and macroeconomic front. Asset manager CoinShares reported that outflows from exchange-traded products hit $455 million over the past nine weeks. Meanwhile, analysts remain divided about Bitcoin's near-term price action. Bollinger Bands creator John Bollinger speculated in a X (formerly Twitter) post that Bitcoin could start an up-move but added that it was “too early to answer.” The volatility could increase after Fed Chair Jerome Powell's press conference but traders should be careful not to get sucked into a bull or a bear trap. It is better to wait on the sidelines and enter after the volatility subsides and a directional move begins. What are the important levels to watch for on Bitcoin and the major altcoins? Let's study the charts of the top-10 cryptocurrencies to find out. Bitcoin is facing stiff resistance at the 50-day simple moving average ($27,154) indicating that the bears are trying to halt the recovery. The upsloping 20-day exponential moving average ($26,499) and the relative strength index (RSI) in the positive territory indicate that bulls are in control. If the price rebounds off the 20-day EMA, it will enhance the prospects of a rally above the 50-day SMA. If that happens, the BTC/USDT pair could climb to $28,143. Conversely, if the price turns down and breaks below the 20-day EMA, it will indicate that the bears remain active at higher levels. A break and close below $26,000 may accelerate selling and sink the pair toward the crucial support at $24,800. Ether ( ETH ) has been maintaining above the breakdown level of $1,626 for the past few days but the bulls have failed to build up on this strength. The long wick on the Sep. 18 and 19 candlestick shows selling by the bears at higher levels. The flattish 20-day EMA ($1,637) and the RSI just below the midpoint suggest a balance between buyers and sellers. A rally above $1,680 could tilt the advantage in favor of the bulls. The ETH/USDT pair could then rally to $1,745. On the contrary, a slide below $1,600 will suggest that bears have not yet given up. That could pull the pair to $1,530. Buyers tried to shove BNB ( BNB ) above the overhead resistance at $220 on Sep. 18 and 19 but the bears defended the level successfully. A minor advantage in favor of the bulls is that they have not allowed the price to slide back below the 20-day EMA ($215). This suggests that the bulls are buying the minor dips as they expect the up-move to extend further. If buyers clear the zone between $220 and the 50-day SMA ($223), the BNB/USDT pair could start a rally toward $235. If bears want to prevent the upside, they will have to tug the price back below the 20-day EMA. That could keep the price stuck inside the $203 to $220 range for a while longer. XRP ( XRP ) rose and closed above the 20-day EMA ($0.50) on Sep. 19, indicating that the bulls have the upper hand. If the price stays above the 20-day EMA, it will suggest that the bulls are trying to flip the level into support. That will open the gates for a potential rise to the overhead resistance at $0.56 where the bears will likely make their stand. The price action of the past few days is showing signs of forming a bullish ascending triangle pattern, which will complete on a break and close above $0.56. Buyers will have to keep XRP price above the uptrend line to safeguard the setup. The bulls have been trying to push Cardano ( ADA ) above the 20-day EMA ($0.25) for the past few days but the bears have not relented. The flattening 20-day EMA and the RSI just below the midpoint suggest a balance between supply and demand. If buyers sustain the price above the 20-day EMA, ADA price will attempt a rally to the overhead resistance at $0.28. Alternatively, if the price turns down sharply from the current level, it will signal that the bears are selling on relief rallies. A break and close below the $0.24 support will indicate the start of the next leg of the downtrend. The next support on the downside is at $0.22. Dogecoin ( DOGE ) has been trading near the 20-day EMA ($0.06) for the past few days, indicating that the bears are defending the level aggressively. A small positive in favor of the bulls is that they have not allowed the price to slip below $0.06. This suggests that the bulls are trying to clear the overhead hurdle. If the 20-day EMA gives way, the DOGE/USDT pair could climb to $0.07 and later to $0.08. Instead, if the price turns down sharply from the current level, it will suggest that the sentiment remains negative and traders are selling on rallies. The bears will then aim to yank the price below $0.06 and challenge the critical support at $0.055. After struggling to rise above the 20-day EMA ($19.55) for a few days, Solana ( SOL ) finally overcame the obstacle on Sep. 18. The 20-day EMA is flattening out and the RSI is just above the midpoint, indicating that the bears may be losing their grip. Buyers will try to push the price to the 50-day SMA ($21.14) and subsequently to the overhead resistance at $22.30. This level is likely to attract strong selling by the bears. This positive view will invalidate in the near term if the SOL/USDT pair turns down and plummets below $18.50. The pair could then retest the strong support at $17.33. Toncoin (TON) is currently in a strong uptrend. The bulls are trying to strengthen their position further by pushing the price above $2.59 but the bears have held their ground. Although the up-move is facing selling near $2.59, the bulls have not ceded ground to the bears. This suggests that the traders are holding on to their positions as they anticipate another leg higher. Above $2.59, the TON/USDT pair could reach $2.90 and eventually $3.28. The upsloping moving averages indicate advantage to buyers but the overbought level on the RSI warns of a possible correction or consolidation in the short term. The first support for TON price on the downside is $2.25 and the next level to watch out for is $2.07. The bulls are struggling to propel Polkadot ( DOT ) above the breakdown level of $4.22, indicating that demand dries up at higher levels. The bears will try to strengthen their position by sinking the price below the immediate support at $4. If they succeed, the DOT/USDT pair risks a slide to the crucial support at $3.90. A break and close below this level may start the next leg of the downtrend. Instead, if the price turns up from the current level and rises above the $4.22-4.33 resistance zone, it could lead to short covering. The pair can first reach the 50-day SMA ($4.50) and thereafter climb to the downtrend line. Polygon ( MATIC ) rose and closed above the 20-day EMA ($0.54) on Sep. 19, indicating that the bulls are attempting a comeback. Still, the 20-day EMA is likely to witness a tough battle between the bulls and the bears. If the bulls maintain the price above the 20-day EMA, the MATIC/USDT pair could climb to the overhead resistance at $0.60 and then to $0.65. Contrarily, if the bears pull the price back below the 20-day EMA, it will signal that higher levels continue to attract selling. The bears will then try to build upon their advantage by pulling the price below $0.49. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.", "url": "https://www.cointelegraph.com/news/price-analysis-9-20-btc-eth-bnb-xrp-ada-doge-sol-ton-dot-matic"},
{"title": "Signal hints at leaving UK market following passage of Online Safety Bill", "subtitle": "Critics of the U.K. Online Safety Bill had pushed for amendments prior to passage, claiming the legislation could allow authorities a backdoor for end-to-end encryption services.", "author": "Turner Wright", "timestamp": "2023-09-20", "content": "A bill aimed at regulating certain internet services in the United Kingdom, including activities in the metaverse, has passed through parliament and awaits King Charles' approval to become law. In a Sept. 19 announcement, the U.K. government said the Online Safety Bill had passed through a final debate in parliament and will become law in the country “soon.” Lawmakers had previously debated whether the legislation aimed at protecting users online — particularly children — could extend to virtual environments like the metaverse. According to the government, the final version of the bill will require social media platforms to “remove illegal content quickly or prevent it from appearing in the first place,” focusing on material deemed harmful to children. The firms will also need to release risk assessments for users, detailing how to report problems related to online safety. “If social media platforms do not comply with these rules, [the Office of Communications] could fine them up to £18 million or 10% of their global annual revenue, whichever is biggest — meaning fines handed down to the biggest platforms could reach billions of pounds,” said the government. Some opponents of the bill had pushed for amendments providing protections for end-to-end encryption, saying the legislation could allow the government a backdoor and undermine user privacy. In June, Apple reportedly said the then-version of the bill “pose[d] a serious threat” surrounding “surveillance, identity theft, fraud, and data breaches.” Meredith Whittaker, president of the Signal Foundation, said in a Sept. 20 X post that the encrypted messaging app could leave the U.K. if the firm were “forced to build a backdoor” under the Online Safety Bill guidelines. Her statement followed the final consideration of amendments in parliament, in which lawmakers did not specify protections for such encrypted services. Signal will never undermine our privacy promises & the encryption they rely on. Our position remains firm: we will continue to do whatever we can to ensure people in the UK can use Signal. But if the choice came down to being forced to build a backdoor, or leaving, we we'd leave. — Meredith Whittaker (@mer__edith) The passage of the Online Safety Bill came the same day as the House of Lords moved forward with the Economic Crime and Corporate Transparency Bill, aimed at addressing crypto-related financial crimes in the United Kingdom. Lawmakers will consider final amendments to the legislation before passage, but the most recent version would seemingly allow U.K. authorities to have greater power in investigating and seizing crypto used for illicit purposes. On Sept. 1, the U.K. Travel Rule applying to crypto firms offering services to residents went into effect , following adoption in countries including the United States, Japan and Germany. The framework could require firms to halt certain crypto transfers from jurisdictions not already in compliance with the Travel Rule.", "url": "https://www.cointelegraph.com/news/signal-hints-leaving-uk-following-online-safety-bill"},
{"title": "Troubled crypto exchange JPEX applies for deregistration in Australia", "subtitle": "The unlicensed exchange allegedly solicited more than $128 million from users before being reprimanded by the Hong Kong Securities and Futures Commission.", "author": "Zhiyuan Sun", "timestamp": "2023-09-20", "content": "Troubled Hong Kong crypto exchange JPEX has applied for deregistration in Australia. According to a filing seen by Cointelegraph on Sept. 20, Jieyi Chen, director of JP-EX Crypto Asset Platform PTY LTD (JPEX), has filed a deregistration application with the Australian Securities and Investment Commission. In the filing, JPEX claims that all members of the company agree to the deregistration, the company is no longer carrying business, its assets do not exceed $1,000 Australian dollars, and it carries no liabilities. On Sept. 13, during the Token2049 conference in Singapore, the JPEX team allegedly abandoned its corporate booth after Hong Kong police arrested six JPEX employees on charges of fraud for operating an unlicensed crypto exchange. The Hong Kong Securities and Futures Commission (SFC) said on the same day that it received over 1,000 complaints regarding the JPEX platform, with claims of losses amounting to over 1 billion Hong Kong dollars ($128 million). As the issue became publicized, JPEX reportedly raised its withdrawal fees to 999 USDT ( USDT ) to prevent transfers out of the exchange. Previously, JPEX had offered yields as high as 30% per year on stablecoin staking. The website is currently inaccessible at the time of publication. Shortly before its takedown, JPEX published a compensation plan for users, claiming that users would be reimbursed on a “one-to-one” basis with their assets exchanged for a stake in the JPEX decentralized autonomous organization by Sept. 21. The exchange also wrote that third-party custodians have “maliciously frozen” platform assets due to the SFC investigation, which has led to an “unprecedented catastrophe.” 'AI has killed the industry': EasyTranslate boss on adapting to change", "url": "https://www.cointelegraph.com/news/troubled-crypto-exchange-jpex-applies-deregistration-australia"},
{"title": "PayPal rolls out PYUSD stablecoin to Venmo users", "subtitle": "The payments platform said PayPal USD will be “rolling out fully in the coming weeks” after announcing its launch on Venmo.", "author": "Turner Wright", "timestamp": "2023-09-20", "content": "Major United States-based payment processor PayPal has announced its PYUSD ( PYUSD ) stablecoin is now available on Venmo. In a Sept. 20 blog post, the payments firm said PayPal USD, the company's stablecoin pegged to the U.S. dollar, is already available to Venmo users and will be “rolling out fully in the coming weeks.” The news came roughly six weeks after PayPal announced the launch of the stablecoin, saying at the time it would be issued by Paxos Trust and fully backed by U.S. dollar deposits, short-term Treasurys and similar cash equivalents. “PYUSD is already present in native crypto experiences, and continues to be made more broadly available as the ecosystem grows,” said PayPal. “In the few weeks since its launch in the open market, PYUSD is already present on select exchanges including Crypto.com, Bitstamp, Coinbase, and Kraken.\" PayPal USD issued by Paxos is now available on @Venmo to select users and will be rolling out fully in the coming weeks! @PayPal USD is unlocking the future of money movement. Learn more here: https://t.co/qgDagf5kB5 pic.twitter.com/9yEszDNJQG — Paxos (@Paxos) Blockchain analytics firm Nansen reported in August that roughly 90% of PYUSD was held in wallets controlled by Paxos Trust. Crypto firm BitPay announced on Sept. 12 that it would be adding support for PYUSD, citing “payment utility and community involvement.” PayPal has been making steady inroads into the crypto space, accepting digital asset payments in 2021 and establishing on- and off-ramps for Web3 payments in 2023. The New York State Department of Financial Services included PYUSD on its greenlist of coins approved by the regulator.", "url": "https://www.cointelegraph.com/news/paypal-rolls-out-pyusd-stablecoin-venmo"},
{"title": "Bitcoin price tests $27K support as Fed holds interest rates at FOMC", "subtitle": "Bitcoin weathers the Fed's decision to keep rates at their previous levels, while Chair Jerome Powell reveals the potential for another hike to come this year.", "author": "William Suberg", "timestamp": "2023-09-20", "content": "Bitcoin ( BTC ) saw snap volatility on Sept. 20 as the United States Federal Reserve maintained interest rates at 20-year highs. Data from Cointelegraph Markets Pro and TradingView followed BTC price action as it reacted to the rate decision and accompanying commentary from Fed Chair Jerome Powell. The Federal Open Market Committee (FOMC) opted to keep rates at their previous levels set in July this year. “The Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over the longer run,” a press release stated. “In support of these goals, the Committee decided to maintain the target range for the federal funds rate at 5-1/4 to 5-1/2 percent.” The move was overwhelmingly expected ahead of time by markets, with a 99% probability of a rate hike pause already in place, per data from CME Group's FedWatch Tool. The Fed's language remained cautious over the future of inflation, however, with no guarantee that conditions would become more lax. “In assessing the appropriate stance of monetary policy, the Committee will continue to monitor the implications of incoming information for the economic outlook. The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee's goals,” the release continued. SUMMARY OF FED DECISION (9/20/23): 1. Fed PAUSES rate hikes leaving rates unchanged 2. 12 Fed officials see 1 more rate hike 3. 7 Fed officials see no more rate hikes 4. Fed sees rates higher for longer 5. Fed sees inflation at 2.6% in 2024 Is the Fed pause finally here? — The Kobeissi Letter (@KobeissiLetter) Reacting, Michaël van de Poppe, founder and CEO of trading firm Eight, suggested that no more rate hikes would come in the future. Bitcoin, he predicted, would benefit. “No rate hike from the FED. My best guess: we're done with the hiking policy,” part of an X post read. “Bitcoin is likely to start trending up from here (yes, a fakeout usually happens at the news).” BTC price action saw jitters as the decision came, with Powell still to complete his speech at the subsequent press conference at the time of writing. Bitcoin price all-time high will precede 2024 halving — New prediction The road to getting inflation down to the Fed's 2% target, he said, had “a long way to go.” “If the economy evolves as projected, the median participants projects that the appropriate level of the federal funds rate will be 5.6% at the end of this year, 5.1% at the end of 2024 and 3.9% at the end of 2025,” he said. Powell noted that the medium projection for the end of the year was unchanged from before but had moved up 0.5% for the end of the next two years. BTC/USD continued to hold above $27,000 as a result, with no major exit from the recent intraday trading range. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.", "url": "https://www.cointelegraph.com/news/bitcoin-price-27k-fed-holds-interest-rates-fomc"},
{"title": "US Democrats speak up for CBDC global leadership, Republicans fear 'dark side'", "subtitle": "Despite approaching the issue from vastly different angles, the two sides were able to agree on a few basics as the bill passed out of committee.", "author": "Derek Andersen", "timestamp": "2023-09-20", "content": "Debate in the United States House Financial Services Committee during the markup of the CBDC Anti-Surveillance State Act on Sept. 20 occasionally wandered beyond strictly financial and technical issues. Star Wars and anarchists were mentioned in the discussion at various points, as were crypto bros. Beneath the rhetoric, the value of research, U.S. citizens' privacy and the role of government in everyday life were discussed as they relate to a U.S. central bank digital currency (CBDC). Tom Emmer introduced the bill after several other bills had been passed through the committee. He characterized his bill as “simple,\" saying, “It halts the efforts of the administrative state under President Biden from issuing a financial surveillance tool that will undermine the American way of life.” “If not designed to emulate cash, [it] could give the federal government the ability to surveil and restrict Americans' transactions.” Emmer mentioned the Chinese digital yuan and government social credit system and Canada's freezing of bank accounts during the truckers' protest of 2022 as he introduced the bill. The bill has the support of 60 senators and numerous organizations, according to Emmer. Ranking member Maxine Waters renamed the bill The CBDC Anti-Innovation Act. She said it would threaten the status of the dollar as the principal global reserve currency, adding: “We don't know at this point how the introduction of CBDCs could shape the global financial landscape. […] Republicans are making baseless attacks against a CBDC that does not even exist.” Later she said the bill would “give China the reins to set the global standard for central bank digital currencies.” Stephen Lynch pointed out some inconsistent language in the bill, and there were questions about what research on CBDC would be allowed under the bill, which was taken up repeatedly during the debate. Brad Sherman compared cryptocurrency unfavorably to CBDCs. “Keep in mind, this is a pilot program. Keep in mind, no one has to have any digital currency,” he said. Rep. Tom Emmer: Digital assets will be a 'sleeper issue' for 2024 elections Mike Flood was among those who did not want to trust the government with the power a CBDC could give it. He suggested the government committee members: “Picture a politician they dislike the most. […] Now imagine that person, and all the ill intentions you ascribe to them, with the power that comes with a retail CBDC.” The legislators eventually agreed that the bill prevents the issuance of a CBDC without an act of Congress, which has been insisted on by the Federal Reserve from the beginning. The general lack of financial privacy in the country was also noted by both sides. The Financial Services Committee is set to vote on my bill, the CBDC Anti-Surveillance State Act, today. Watch my remarks from the debate: pic.twitter.com/C4S3okdl0w — Tom Emmer (@GOPMajorityWhip) Waters and Lynch introduced amendments to clarify the bill's reach over research to authorize the Fed to study the Chinese digital yuan, which could facilitate efforts to evade U.S. sanctions. Waters made reference to the mBridge pilot between China, Hong Kong, Thailand and the United Arab Emirates. The committee went into recess at 1:30 p.m., local time, after four hours. After reconvening, the committee rejected the amendments and passed the bill, recommending it to the full House on a vote of 27 to 20. Opinion: GOP crypto maxis almost as bad as Dems' 'anti-crypto army'", "url": "https://www.cointelegraph.com/news/dems-speak-up-global-leadership-us-cbdc-republicans-fear-dark-side"},
{"title": "Evmos, Swing, Tashi, Wormhole team up to solve Cosmos' liquidity issues", "subtitle": "Tashi and Swing will integrate Wormhole bridged tokens for USDC, USDT, wETH and others, potentially making Cosmos DeFi easier to use.", "author": "Tom Blackstone", "timestamp": "2023-09-20", "content": "A group of decentralized finance (DeFi) protocols have teamed up to solve liquidity problems in the Cosmos ecosystem. The teams involved include cross-chain bridging protocol Wormhole, liquidity aggregator Swing, lending protocol Tashi and Cosmos network Evmos. According to statements from two of the teams involved, Wormhole will register five new bridged tokens for use on Evmos: Tether ( USDT ), USD Coin ( USDC ), wrapped Ether (wETH), wrapped Bitcoin (wBTC) and Solana ( SOL ). A Wormhole governance vote on this part of the proposal began on Sept. 19 and currently has near unanimous support. Once the tokens are launched on Evmos, they will be implemented into Swing protocol, which will allow users to send them to Evmos from any network that Swing supports, including BNB Chain, Polygon, Fantom and others. Tashi will also implement Swing into its user interface, allowing users to bridge the coins and deposit them as collateral with a minimum of button clicks. Users will then be able to take out loans of either Cosmos-based or Ethereum-based coins using this collateral, swap the loaned coins for others, deposit them into liquidity pools or perform other common DeFi actions. According to representatives from both Swing and Tashi, the integrations are ready to go live and are simply waiting for the Wormhole proposal to pass and be implemented. The proposal's vote will come to an end on Sept. 24, which implies that the new liquidity system should go live soon afterwards. In a conversation with Cointelegraph, Tashi co-founders Lindsay Ironside and Kristine Boulton claimed that the new system is needed to fix a “crisis” in liquidity within the Cosmos ecosystem. “We've got this chain that continues to deliver these amazing opportunities, but nobody's using it because they can't get liquidity there,” Boulton stated. But “[Wormhole], they're on, I think it's 29 different chains right now [...] so it is an opportunity to fix that crisis.” Ironside stated that she felt a new system was needed after she first began using the Cosmos ecosystem. She had a bad user experience the first time she attempted to swap USDC for Cosmos ( ATOM ) and send it to Evmos. In order to obtain the ATOM, she needed to first bridge her USDC to Cosmos Hub. Once the USDC was on the network, however, she didn't have the ATOM to pay the gas fee to make the swap. According to Ironside, this experience caused her to realize that the team needed to focus on this problem. “Coming in as new users [...] and trying to figure out where the solutions to these problems were, [that] was a big deal,” she remarked. In a separate conversation, Swing CEO Viveik Vivekananthan agreed that the new system will potentially fix these problems. If a user wants to swap USDC for a different coin on Evmos, Swing will convert a small portion of the coins sent into the Evmos native coin, which will then be spent on gas to make the swap. This will allow users to onboard into Evmos using any supported coin, Vivekananthan explained. In the beginning, Swing will only be able to bridge tokens from mostly non-Cosmos networks into Evmos, he stated, but the team plans to expand its compatibility to allow bridges between different Cosmos networks in the future. The Cosmos community has been making a concerted effort to attract users with new features in 2023. Cosmos-based chain Noble launched a native version of the USDC stablecoin on March 28, and Cosmos Hub implemented liquid staking on Sept. 13. However, the ecosystem also faces a competitor in the form of the Optimism Superchain, which is attempting to build an interconnected web of blockchains with similar features to Cosmos.", "url": "https://www.cointelegraph.com/news/evmos-swing-tashi-wormhole-team-up-solve-cosmos-liquidity-problems"},
{"title": "Apple, Goldman Sachs drop plans for trading app: Report", "subtitle": "Initial plans called for a 2022 rollout, but economic conditions caused the project to be reportedly shelved last year.", "author": "Ana Paula Pereira", "timestamp": "2023-09-20", "content": "Apple and Goldman Sachs scrapped plans to launch an app for futures trading, CNBC reported on Sept. 19, citing people familiar with the plans. The project had an initial rollout date for 2022, but it was put on hold last year as economic conditions deteriorated, with a rise in interest rates and inflation pressures driving investors away from risky assets. According to the sources, the project infrastructure was “mostly built” and is ready for launch if Apple proceeds with its original plan. Additionally, it is unclear whether Goldman and Apple intended to include crypto futures trading in the application. During the pandemic, Apple sought to diversify its business and offer financial solutions for clients in the United States, partnering with Goldman Sachs to develop its initiatives. Looks like all big technology guys are tying back to a Fin-tech product. https://t.co/lYWowJ14np — Githinji Mwai (@GithinjiMwai) In collaboration with the bank, Apple first launched a credit card in 2019. Earlier this year, the tech giant released its buy now, pay later feature, allowing users to split purchases into four equal payments without charging any interest. A few weeks later, in April, the company announced another Goldman Sachs-backed product, a savings account providing a 4.15% annual percentage yield. According to a recent report, user deposits in Apple's savings account had topped $10 billion. However, the partnership was not without its challenges. Goldman Sachs reportedly suffered a financial setback from managing Apple's credit card, with an average customer acquisition cost of $350. Apple's venture into financial services isn't an isolated move. After acquiring X (formerly Twitter), Elon Musk disclosed plans to make the social network an “everything app,” incorporating financial services on the platform. According to Musk, in the coming months, users will be able to conduct their “entire financial world” on X. Musk's plans appear to be moving forward. Rhode Island regulators granted X a currency transmitter license on Aug. 30, marking a step forward for the company's venture into financial services. The license is required for companies providing financial services on behalf of users, which includes both fiat and crypto assets. As a result of the approval, X will be able to custody, transfer and exchange digital currencies. Money transmitter licenses were also issued to X in Arizona, Georgia, Maryland, Michigan, Mississippi, Missouri and New Hampshire.", "url": "https://www.cointelegraph.com/news/apple-goldman-sachs-drop-plans-trading-app-report"},
{"title": "Here's what happened in crypto today", "subtitle": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.", "author": "Serge Egon Ostman", "timestamp": "2023-09-20", "content": "The Mt. Gox repayment deadline has been pushed another year, moving to Oct. 31, 2024. Meanwhile, PayPal has launched PYUSD on Venmo starting September 20 and rolling out to all eligible users throughout the next few weeks and CoinEx has rebuilt its wallet system following a $70 million hack and is set to resume deposit and withdrawals for select cryptocurrencies. Mt. Gox trustee Nobuaki Kobayashi has officially changed the deadline for paying back the exchange's creditors from Oct. 31, 2023, to Oct. 31, 2024. In a Sept. 21 letter , Kobayashi wrote that, with the permission of the Tokyo District Court, he had extended the deadline for the base repayment, the early lump-sum repayment and the intermediate repayment. Mt Gox trustee moved the repayment deadline from October 31, 2023 to October 31, 2024 (one year forward) pic.twitter.com/uoqVKRFgFk — Summers (@SummersThings) Presently, the Mt. Gox estate holds some 142,000 Bitcoin (BTC), 143,000 Bitcoin Cash (BCH) and 69 billion Japanese yen. Mt. Gox was one of the earliest cryptocurrency exchanges, once facilitating more than 70% of all trades made within the blockchain ecosystem. Following a major hack in 2011, the site subsequently collapsed in 2014 due to alleged insolvency; the fallout affected about 24,000 creditors and resulted in the loss of 850,000 BTC. PayPal announced the immediate availability of its PYUSD stablecoin on the Venmo platform. According to a statement, PYUSD is already available to some Venmo users and will be rolling out fully in “the coming weeks” “PYUSD is already present in native crypto experiences, and continues to be made more broadly available as the ecosystem grows,” said PayPal, in a statement. “In the few weeks since its launch in the open market, PYUSD is already present on select exchanges including Crypto.com, Bitstamp, Coinbase, and Kraken.\" The community response on X has been almost uniformly positive with many calling the move “bullish” or otherwise indicating general approval. bullish — bojak.eth (@W0JAK) Cryptocurrency exchange CoinEx is set to resume deposit and withdrawals for its users more than a week after it suffered a $70 million hack due to compromised hot wallet private keys. In previous correspondence with Cointelegraph, the exchange outlined its priority to build and deploy a new wallet system to facilitate activities for the 211 blockchains and 737 tokens that it served before the hacking incident. The latest statement from the exchange announces the resumption of deposit and withdrawal services of BTC, ETH, USDT, USDC and other tokens from Sept. 21. CoinEx will update deposit addresses for the listed tokens and will generate new deposit addresses for its users. CoinEx customers were advised not to deposit into old addresses on the platform, as this would result in assets being permanently lost. The exchange also warned of a potentially large number of pending withdrawals at the resumption of its operations: “We ensure the new wallet system is stable, and we will gradually resume deposit and withdrawal services for more assets.” The exchange maintains that it has implemented a 100% asset reserve policy to safeguard users against potential security threats. Previous updates following the hacking incident also stated that users assets were not affected and that CoinEx's User Asset Security Foundation would cover any financial losses. CoinEx has since revealed that compromised private keys for a number of its hot wallet addresses allowed hackers to withdraw some $70 million worth of cryptocurrencies. The hot wallets were used as temporary storage for user deposits, withdrawals and temporary storage. Blockchain analytics firm Elliptic has linked the incident to North Korean “Lazarus Group” hackers, while the exchange told Cointelegraph that it was still investigating the identity of the perpetrators. CoinEx released further details of the assets that were stolen in the incident on Sept. 20. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.", "url": "https://www.cointelegraph.com/news/what-happened-in-crypto-today"},
{"title": "International financial group finds gaps in digital euro legislative package", "subtitle": "The Institute of International Finance looked at seven areas where digital euro legislation, which is being developed alongside the technology, is lacking.", "author": "Derek Andersen", "timestamp": "2023-09-20", "content": "The Institute of International Finance (IIF) has published an assessment of the European Commission's proposed legislation on the digital euro. It gave the bill average marks. The IIF is a financial industry global advocacy group headquartered in Washington, D.C. with members in 60 countries. It rated the digital euro bill introduced in June and the impact assessment that accompanied it. The note is a follow-up to its comments submitted in June. The IIF looked at seven areas. It considered six of those areas “partly addressed” by the proposed legislation. Some of the cost-benefit analysis was “basic and high-level,” while other aspects were dependent on previous studies or missing. The mechanism suggested for financial stability and bank intermediation in the bill is holding limits. Those limits have yet to be set, and it is unclear how they would be enforced, the IIF said. IBM offers guidance for successful implementation of digital euro Payment services providers (PSPs) would have limited ability to recover the costs of implementing digital euro services, such as connecting to the infrastructure and creating wallet software, while caps are placed on fees. Credit institutions would be required to provide basic digital euro services for free. Therefore, “economic and liability model challenges” were also found to be only partly addressed, the study found. Privacy controls on the digital euro have yet to be defined, the study noted, and it is not clear what PSPs will need to do in order to meet the requirements or if doing so will even be possible for them at the time of the digital euro's introduction. Anti-Money Laundering and cybersecurity measures also remain to be established. The Institute of International Finance welcomes the opportunity to respond to the European Commission (EC) questionnaire on a potential euro-denominated central bank digital currency (CBDC). https://t.co/A1MF505OEH @IIF #eurozone #financialsystem #DigitalEuro — Fabien Risterucci (@FRProspektiv) Governance and conflicts of interest were not addressed in the legislation, the IIF said. As the bank supervisor and “issuer, administrator and fee-setter for a digital euro,” the European Central Bank (ECB) could find itself in conflicting roles of regulator and operator. There is no independent oversight envisioned for it. The IIF also repeated its position on interoperability. It said: “There is little-to-no value in settling for recreating parallel systems that could tie up capital and liquidity, face similar pain points, and be expensive. […] A CBDC would need to operate on platforms where other digital currencies otherwise operate.” The legislative proposal for the digital euro is being developed in tandem with its infrastructure. The digital euro is expected to be in the investigative phase through October. After that, the ECB may decide to begin testing technical and business solutions, but either way, a live digital euro can only be issued after the legislation passes. Crypto City Guide to Prague: Bitcoin in the heart of Europe", "url": "https://www.cointelegraph.com/news/international-financial-group-finds-gaps-digital-euro-legislative"},
{"title": "OnlyFans, Patreon models turn to Web3 amid payment and censorship fears", "subtitle": "Patreon creators had difficulties getting paid in August, while OnlyFans once tried to ban porn on the platform, forcing creators to look at alternatives, including Web3.", "author": "Brayden Lindrea", "timestamp": "2023-09-20", "content": "Adult content creators have continued to shift towards decentralized versions of OnlyFans and Patreon, after recent payment difficulties and the ever-present threat of being de-platformed. Leon Lee, founder and CEO of Only1 — a decentralized version of OnlyFans — tells Cointelegraph there has been a recent power shift from intermediaries to content creators, thanks to Web3. “The role of intermediaries are diminishing while the role and earnings of creators are increasing,” said Lee. In August, creators on Patreon reported having difficulties withdrawing their earnings from the platform as payments were being flagged as fraudulent by banks. I told the credit card company the charge was valid, fine. Patreon sent an email saying \"click here to update your payment\" and that link goes to a 404 error. My list of supported creators is gone, I have to try to remember who I was supporting - there is nothing on the site 2/ — Jason Pargin, author of John Dies at the End, etc (@JasonKPargin) Many content creators also haven't likely forgotten when OnlyFans tried to ban sexually explicit content in 2021, only to reverse the decision days later. Speaking to this, Lee argues that creators will always be at risk of being deplatformed as long as they stay on centralized platforms using traditional payment rails. “Creators are still at risk of being deplatformed and are not realizing their full earning potential.” Only1 was launched on the Solana blockchain in March 2023 — backed by Animoca Brands. However, the platform is just one out of many startups looking to capture the magic of adult subscription platforms with a decentralized crypto twist. 1/ Introducing the Creator Economy 4.0 Traditional creator subscription platforms fell short when it comes to payments, incentives and censorship. This is all about to change, starting here on @solana . Read on pic.twitter.com/TABSvzO1HX — Only1 (@JoinOnly1) In 2022, OnlyFans model Allie Rae created a crypto-powered adult content platform WetSpace, as an alternative to OnlyFans. Rae told Cointelegraph in December 2022 that she created the platform to circumvent the payment pressures that creators on platforms like OnlyFans were receiving from banks: “I started to figure out that the banks really were largely in part the driving force behind some of those decisions that platforms were having to make. And so that naturally led to me: How do you get rid of the banks? And crypto came out like a knight in shining armor.” More recently, creators on OnlyFans started flocking to Friend.tech, a new decentralized social media platform built on Coinbase's layer-2 network Base. gm web3. im shaking rn officially 1 / 292 FT girl @friendtech when merch? i'll rock it. pic.twitter.com/Qm84AajCWt — gracie♡ (@ilovegraciexo) Lee believes a mass migration event will happen when more creators realize they don't want to be shackled by censorship rules imposed by a centralized intermediary. “Creators are already waking up to the fact and are becoming less dependent on intermediaries to monetize,” Lee said. He acknowledged that TV producers, advertisers and brands will maintain a market share in the creator economy, but said a true peer-to-peer payment infrastructure like blockchain is the “next logical step” for creators: “By removing the dependency on traditional payment processors, a web3 platform and its community can have full autonomy over the types of content allowed,” he said, adding: Since the OnlyFans adult content censorship, creators have been creating 'backup accounts' on different platforms due to such deplatform risk.” Proof of Peach, SEXN and Keyhole are three other adult entertainment platforms working in the Web3 space. Lee believes more creators will eventually flock to decentralized platforms that provide them with “full autonomy” over their content and full ownership rights to the money they make: “It is an inevitable future where there will no longer be any intermediaries between fans and creators — this is an obvious but unrealized potential of blockchain technology.”", "url": "https://www.cointelegraph.com/news/onlyfans-patreon-models-turn-to-web3-payment-censorship-fears"},
{"title": "Meta launches metaverse game, Bitcoin Ordinals creator proposes numbering change: Nifty Newsletter", "subtitle": "Meta has rolled out early access for Horizon Worlds on web browsers and mobile devices.", "author": "Ezra Reguerra", "timestamp": "2023-09-20", "content": "In this week's newsletter, read about how marketplace Magic Eden integrated compressed nonfungible tokens (NFTs) into its platform and how Meta launched its metaverse game on mobile and web. Check out why the Bitcoin Ordinals creator proposes changing the protocol's numbering system and learn about Atari founder Nolan Bushnell's perspectives on play-to-earn gaming. In other news, the United States Securities and Exchange Commission (SEC) has charged NFT collection Stoner Cats with offering unregistered securities. Meta has announced it has started rolling out Horizon Worlds on mobile devices and web browsers. The launch to mobile and web includes a free-for-all shooter game called Super Rumble, where two to six players can play together in fast-paced shooting matches. The launch is only in early access, meaning only a few people can join. According to Meta, it will slowly roll the game out to more people and add more experiences and worlds to the metaverse in the near future. Bitcoin Ordinals chief coder and creator Casey Rodarmor proposed to change the numbering system of Bitcoin NFTs. The coder highlighted that the current system has led to “ugly code and stalled development.” Because of this, Rodarmor initiated a proposal to make inscriptions permanently unstable, making the protocol simpler and easier to upgrade. The Ordinals creator added that while the change may make the numbers inaccurate, the numbering system will not be scrapped entirely. NFT marketplace Magic Eden has integrated compressed NFTs (cNFTs) by Solana into its platform. According to Magic Eden, cNFTs will allow users to experiment without spending too much money and are ideal for mass-produced NFTs for industries like music, gaming and events. cNFTs are different from standard NFTs, as their data is stored off-chain. Because of this, users can mint as many as one million NFTs for just around $110. Nolan Bushnell, the founder of Atari, a video game company that peaked in popularity in the 1980s, recently spoke with Cointelegraph and expressed that play-to-earn (P2E) games are the reason why “real” gamers dislike crypto. The executive claimed that “good gamers” don't like to grind and said that Web3 gaming needs to move away from P2E and focus on building worlds powered by virtual reality and augmented reality. The SEC has charged the company behind the NFT collection Stoner Cats with offering unregistered securities. According to the SEC, the NFTs were marketed as having potential for secondary sales and implied that the value would rise. However, not everyone in the SEC agrees with the action. SEC commissioners Hester Pierce and Mark Uyeda published a dissenting statement, arguing that the project's activity constitutes fan crowdfunding, which they believe is a common occurrence in the world of creators. CHECK OUT COINTELEGRAPH'S PODCAST", "url": "https://www.cointelegraph.com/news/meta-launches-metaverse-game-bitcoin-ordinals-creator-proposes-numbering-change-nifty-newsletter"},
{"title": "Crypto exchange Kraken 'disappointed' over regulator proceedings in Australia", "subtitle": "The regulator alleged that Bit Trade, the provider for Kraken in Australia, did not make a target market determination before offering its margin trading product to Australian customers.", "author": "Tom Mitchelhill", "timestamp": "2023-09-21", "content": "The Australian Securities and Investments Commission (ASIC) has commenced civil proceedings against Bit Trade, the provider of the Kraken crypto exchange in Australia, for failing to comply with design and distribution obligations for one of its trading products. According to a Sept. 21 statement from ASIC, the Australian financial regulator alleged that Bit Trade failed to make a target market determination before offering its margin trading product to Australian customers. Design and distribution obligations are legal requirements for firms that offer financial products in Australia. The obligations set forth specific requirements for firms to design financial products that meet pre-determined needs of customers and then distribute them through a targeted plan. We are suing Bit Trade, provider of the Kraken crypto exchange in Australia, for allegedly failing to comply with the design and distribution obligations (DDO) for its margin trading product. Since October 2021, customers have lost about $12.95 million https://t.co/MCRYqah0dP pic.twitter.com/zURQ2xDw7M — ASIC Media (@asicmedia) The regulator claimed that since the introduction of design and distribution obligations in October 2021, at least 1,160 Australian customers had used Bit Trade's margin trading product and had incurred a total loss of approximately $8.35 million (12.95 million Australian dollars). ASIC said that it had notified Bit Trade of its failure to comply with the obligations in June 2022; however, it alleges that Bit Trade continued to offer the product without ever making the relevant determinations. Jonathon Miller, managing director of Kraken's Australian operations, told Cointelegraph that ASIC's move came as a surprise, as he believed the product was compliant with the local obligations. “We have been attempting to constructively engage with ASIC on this matter for some time to ensure our product offering, as an AUSTRAC-registered Digital Currency Exchange, remains compliant,” said Miller. “We are therefore both surprised and disappointed to have received today's enforcement action. We believe this product is offered in compliance with Australian law and will continue our efforts to receive clarity on this matter.” Bit Trade's margin trading product is a “margin extension” service that allows customers to receive an extension of credit up to five times the value of the assets they use as collateral. Aussie fintech prays for crypto clarity as it launches Bitcoin-backed loans The financial regulator claimed that this product is in fact a “credit facility,” as it offers customers “credit for use in the sale and purchase of certain crypto assets on the Kraken exchange.” ASIC deputy chair Sarah Court said that the proceedings should serve as a reminder to the crypto industry that financial products will continue to be scrutinized by regulators to ensure they are compliant with the country's consumer protection laws. “ASIC's action should be a reminder of the importance to comply with the design and distribution obligations so that financial products are distributed to consumers appropriately.” Updated Sept. 21, 4:07am UTC : This article has been updated to include comment from Kraken for Australia managing director Jonathon Miller. How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in", "url": "https://www.cointelegraph.com/news/australia-regulator-asic-sues-bit-trade-over-margin-trading-product"},
{"title": "Balancer blames 'social engineering attack' on DNS provider for website hijack", "subtitle": "Blockchain security firms SlowMist and CertiK also believe the crypto wallet drainer, Angel Drainer, was involved in the estimated $238,000 exploit.", "author": "Brayden Lindrea", "timestamp": "2023-09-21", "content": "The team behind Balancer, an Ethereum-based automated market maker, believes a social engineering attack on its DNS service provider was what led to its website's front end being compromised on Sept. 19, leading to an estimated $238,000 in crypto stolen . “After investigation, it is clear that this was a social engineering attack on EuroDNS, the domain registrar used for .fi TLDs,” the firm explained in a Sept. 20 X post. Approximately eight hours after the first warning of the attack, Balancer said its decentralized autonomous organization (DAO) was actively addressing the DNS attack and was working to recover the Balancer UI. At 5:45 pm UTC on Sept. 20, Balancer said it was successful in securing the domain and bringing it back under the control of Balancer DAO. It also confirmed its subdomains “app.balancer.fi” and “balancer.fi” are safe to use again. After investigation it is clear that this was a social engineering attack on EuroDNS, the domain registrar used for .fi TLDs. We are exploring deprecating the .fi TLD in order to move to a more secure registrar and suggest that other projects using the TLD do the same. [2/2] — Balancer (@Balancer) However, it suggested any other projects using the same top-level domain should consider moving to a more secure registrar. EuroDNS is a Luxembourg-based domain name registrar and DNS service provider. Cointelegraph has reached out to EuroDNS for comment. Blockchain security firms SlowMist and CertiK reported that the attacker employed Angel Drainer phishing contracts. SlowMist said the exploiters attacked Balancer's website via Border Gateway Protocol hijacking — a process where hackers take control of IP addresses by corrupting internet routing tables. The hackers then induced users to “approve” and transfer funds via the “transferFrom” function to the Balancer exploiter, it explained. The hacker, whom SlowMist believes may be related to Russia, has already bridged some of the stolen Ether (ETH) to Bitcoin (BTC) addresses via THORChain before eventually bridging the ETH back to Ethereum, blockchain security firm SlowMist explained on Sept. 20. SlowMist stated in an earlier post that the hacker transferred about 15 wrapped-Ether (wETH.e) on the Avalanche blockchain. Balancer Hack Update So far, we have the following findings about the @Balancer exploiter: 1/ The attacker's fee came from the phishing group #AngelDrainer . In other words, after the attacker (AngelDrainer) attacked the website via BGP hijacking, then induced users to… https://t.co/5g6P2aPEz8 pic.twitter.com/3PInfe9VC1 — MistTrack (@MistTrack_io) Meanwhile, despite Balancer confirming its subdomains on “balancer.fi” to now be safe, the “Deceptive site ahead” warning still appears when attempting to access Balancer's website. Cointelegraph reached out to Balancer to confirm the amount of funds lost, but did not receive an immediate response.", "url": "https://www.cointelegraph.com/news/balancer-social-engineering-attack-dns-provider-frontend-hijack"}
]